[INFO] æ­£åœ¨å¯åŠ¨...
[INFO] ä»¿çœŸç»ˆç«¯æ¨¡å¼å·²ç”Ÿæ•ˆï¼Œæ‚¨å¯ä»¥ç›´æ¥åœ¨ç»ˆç«¯å†…ç›´æ¥è¾“å…¥å†…å®¹å¹¶ä½¿ç”¨ Ctrlï¼ŒTab ç­‰åŠŸèƒ½é”®
[INFO] å®ä¾‹å·²å¯åŠ¨...
è¯·è¾“å…¥æ“ä½œæŒ‡ä»¤ï¼ˆDownload/Uploadï¼‰ï¼šDownload[INFO] å®ä¾‹å·²åœæ­¢ã€‚
[INFO] æ­£åœ¨å¯åŠ¨...
[INFO] ä»¿çœŸç»ˆç«¯æ¨¡å¼å·²ç”Ÿæ•ˆï¼Œæ‚¨å¯ä»¥ç›´æ¥åœ¨ç»ˆç«¯å†…ç›´æ¥è¾“å…¥å†…å®¹å¹¶ä½¿ç”¨ Ctrlï¼ŒTab ç­‰åŠŸèƒ½é”®
[INFO] å®ä¾‹å·²å¯åŠ¨...

ğŸ“¥ å¼€å§‹ä»SFTPæœåŠ¡å™¨ä¸‹è½½ world.zip...
wrong # args: should be "set varName ?newValue?"
    while executing
"set timeout -1  # ä¿®æ”¹ï¼šå–æ¶ˆè¶…æ—¶é™åˆ¶ï¼ˆ-1è¡¨ç¤ºæ— é™è¶…æ—¶ï¼‰"
[32m[INFO] å¼€å§‹æ£€æŸ¥ä¾èµ–...[0m
[32m[INFO] æ£€æŸ¥ç›®æ ‡ç›®å½•ï¼š/workspace/AppData/MinecraftServer/[0m
[32m[INFO] è¯·è¾“å…¥æ“ä½œæŒ‡ä»¤ï¼ˆDownload/Uploadï¼‰ï¼š[0m
Download[INFO] å®ä¾‹å·²åœæ­¢ã€‚
[INFO] æ­£åœ¨å¯åŠ¨...
[INFO] ä»¿çœŸç»ˆç«¯æ¨¡å¼å·²ç”Ÿæ•ˆï¼Œæ‚¨å¯ä»¥ç›´æ¥åœ¨ç»ˆç«¯å†…ç›´æ¥è¾“å…¥å†…å®¹å¹¶ä½¿ç”¨ Ctrlï¼ŒTab ç­‰åŠŸèƒ½é”®
[INFO] å®ä¾‹å·²å¯åŠ¨...

[32m[INFO] ä½ é€‰æ‹©çš„æ“ä½œï¼šDOWNLOAD[0m
[32m[INFO] åˆ‡æ¢åˆ°ç›®æ ‡ç›®å½•ï¼š/workspace/AppData/MinecraftServer/[0m
[32m[INFO] å¼€å§‹ä¸‹è½½world.zip...[0m
[32m[INFO] å¼€å§‹è¿æ¥SFTPæœåŠ¡å™¨ï¼š156.246.90.110:11520[0m
expect version 5.45.4
argv[0] = expect  argv[1] = -d  
set argc 0
set argv0 "expect"
set argv ""
executing commands from command file
spawn sftp -P 11520 21369@156.246.90.110
parent: waiting for sync byte
parent: telling child to go ahead
parent: now unsynchronized from child
spawn: returns {3650}
invalid command name "fingerprint"
    while executing
"fingerprint"
    invoked from within
"expect {
            "Are you sure you want to continue connecting (yes/no/[fingerprint])?" {
                log_info "é¦–æ¬¡è¿æ¥ï¼Œè‡ªåŠ¨ç¡®è®¤yes..."
[31m[ERROR] SFTPæ“ä½œå¤±è´¥ï¼[0m
[32m[INFO] å¼€å§‹æ£€æŸ¥ä¾èµ–...[0m
[32m[INFO] æ£€æŸ¥ç›®æ ‡ç›®å½•ï¼š/workspace/AppData/MinecraftServer/[0m
[32m[INFO] è¯·è¾“å…¥æ“ä½œæŒ‡ä»¤ï¼ˆDownload/Uploadï¼‰ï¼š[0m
Download[INFO] å®ä¾‹å·²åœæ­¢ã€‚
[INFO] æ­£åœ¨å¯åŠ¨...
[INFO] ä»¿çœŸç»ˆç«¯æ¨¡å¼å·²ç”Ÿæ•ˆï¼Œæ‚¨å¯ä»¥ç›´æ¥åœ¨ç»ˆç«¯å†…ç›´æ¥è¾“å…¥å†…å®¹å¹¶ä½¿ç”¨ Ctrlï¼ŒTab ç­‰åŠŸèƒ½é”®
[INFO] å®ä¾‹å·²å¯åŠ¨...

[32m[INFO] ä½ é€‰æ‹©çš„æ“ä½œï¼šDOWNLOAD[0m
[32m[INFO] åˆ‡æ¢åˆ°ç›®æ ‡ç›®å½•ï¼š/workspace/AppData/MinecraftServer/[0m
[32m[INFO] å¼€å§‹ä¸‹è½½world.zip...[0m
[32m[INFO] å¼€å§‹è¿æ¥SFTPæœåŠ¡å™¨ï¼š156.246.90.110:11520[0m
spawn sftp -P 11520 21369@156.246.90.110
invalid command name "fingerprint"
    while executing
"fingerprint"
    invoked from within
"expect {
            "Are you sure you want to continue connecting (yes/no/[fingerprint])?" {
                send "yes\r"
                exp_continu..."
[31m[ERROR] SFTPæ“ä½œå¤±è´¥ï¼[0m
[0;32m=== Minecraftä¸–ç•Œæ–‡ä»¶ä¼ è¾“å·¥å…· ===[0m
æœ¬åœ°ç›®å½•: /workspace/AppData/MinecraftServer
SFTPæœåŠ¡å™¨: 21369@156.246.90.110:11520

[1;33mæ­£åœ¨æ·»åŠ SFTPä¸»æœºå¯†é’¥åˆ°known_hosts...[0m
# Host [156.246.90.110]:11520 found: line 7
# Host [156.246.90.110]:11520 found: line 8
/root/.ssh/known_hosts updated.
Original contents retained as /root/.ssh/known_hosts.old
[0;32mä¸»æœºå¯†é’¥å·²æ·»åŠ [0m
[0;31mç”¨æ³•: ./gitpush [Download|Upload][0m
[INFO] å®ä¾‹å·²åœæ­¢ã€‚
[INFO] æ­£åœ¨å¯åŠ¨...
[INFO] ä»¿çœŸç»ˆç«¯æ¨¡å¼å·²ç”Ÿæ•ˆï¼Œæ‚¨å¯ä»¥ç›´æ¥åœ¨ç»ˆç«¯å†…ç›´æ¥è¾“å…¥å†…å®¹å¹¶ä½¿ç”¨ Ctrlï¼ŒTab ç­‰åŠŸèƒ½é”®
[INFO] å®ä¾‹å·²å¯åŠ¨...
[INFO] å®ä¾‹å·²åœæ­¢ã€‚
[INFO] æ­£åœ¨å¯åŠ¨...
[INFO] ä»¿çœŸç»ˆç«¯æ¨¡å¼å·²ç”Ÿæ•ˆï¼Œæ‚¨å¯ä»¥ç›´æ¥åœ¨ç»ˆç«¯å†…ç›´æ¥è¾“å…¥å†…å®¹å¹¶ä½¿ç”¨ Ctrlï¼ŒTab ç­‰åŠŸèƒ½é”®
[INFO] å®ä¾‹å·²å¯åŠ¨...
[INFO] å®ä¾‹å·²åœæ­¢ã€‚
[INFO] æ­£åœ¨å¯åŠ¨...
[INFO] ä»¿çœŸç»ˆç«¯æ¨¡å¼å·²ç”Ÿæ•ˆï¼Œæ‚¨å¯ä»¥ç›´æ¥åœ¨ç»ˆç«¯å†…ç›´æ¥è¾“å…¥å†…å®¹å¹¶ä½¿ç”¨ Ctrlï¼ŒTab ç­‰åŠŸèƒ½é”®
[INFO] å®ä¾‹å·²å¯åŠ¨...
[INFO] å®ä¾‹å·²åœæ­¢ã€‚
[INFO] æ­£åœ¨å¯åŠ¨...
[INFO] ä»¿çœŸç»ˆç«¯æ¨¡å¼å·²ç”Ÿæ•ˆï¼Œæ‚¨å¯ä»¥ç›´æ¥åœ¨ç»ˆç«¯å†…ç›´æ¥è¾“å…¥å†…å®¹å¹¶ä½¿ç”¨ Ctrlï¼ŒTab ç­‰åŠŸèƒ½é”®
[INFO] å®ä¾‹å·²å¯åŠ¨...
  æˆ–: ./gitpush [D|U] (å¤§å°å†™ä¸æ•æ„Ÿ)

ç¤ºä¾‹:
  ./gitpush Download   # ä»SFTPä¸‹è½½ä¸–ç•Œæ–‡ä»¶
  ./gitpush Upload     # ä¸Šä¼ ä¸–ç•Œæ–‡ä»¶åˆ°SFTP
ç”¨æ³•: ./gitpush [download|upload] æˆ– ./gitpush [d|u]
ç”¨æ³•: ./gitpush [download|upload] æˆ– ./gitpush [d|u]
=== Minecraftä¸–ç•Œæ–‡ä»¶ä¼ è¾“å·¥å…· ===

ç”¨æ³•: ./gitpush [download|upload]
      æˆ–: ./gitpush [d|u]

ç¤ºä¾‹:
  ./gitpush download   # ä¸‹è½½ä¸–ç•Œ
  ./gitpush upload     # ä¸Šä¼ ä¸–ç•Œ
=== Minecraftä¸–ç•Œæ–‡ä»¶ä¼ è¾“å·¥å…· ===

å¼€å§‹ä¸‹è½½...
ç¬¬ä¸€æ­¥ï¼šæ‰‹åŠ¨è¿æ¥SFTPæœåŠ¡å™¨æ¥å—å¯†é’¥
åœ¨å‡ºç°æç¤ºæ—¶è¾“å…¥ï¼šyes
ç„¶åè¾“å…¥å¯†ç ï¼šxu34LDICRy6!
è¿æ¥æˆåŠŸåè¾“å…¥ï¼šexit

æŒ‰Enterå¼€å§‹æ‰‹åŠ¨è¿æ¥...
21369@156.246.90.110's password: 
[INFO] å·²æ‰§è¡Œé¢„è®¾çš„å…³é—­å‘½ä»¤ï¼š
^c
å¦‚æœæ— æ³•å…³é—­å®ä¾‹è¯·å‰å¾€å®ä¾‹è®¾ç½®æ›´æ”¹å…³é—­å®ä¾‹çš„æ­£ç¡®å‘½ä»¤ï¼Œæ¯”å¦‚ exitï¼Œstopï¼Œend ç­‰

ç¬¬äºŒæ­¥ï¼šè‡ªåŠ¨ä¸‹è½½æ–‡ä»¶
æ­£åœ¨ä¸‹è½½world.zip...
spawn sftp -P 11520 21369@156.246.90.110
21369@156.246.90.110's password: 
Connected to 156.246.90.110.
sftp> cd /
sftp> lcd /workspace/AppData/MinecraftServer
sftp> get world.zip
File "/world.zip" not found.
sftp> bye
[INFO] å®ä¾‹å·²åœæ­¢ã€‚
[INFO] æ­£åœ¨å¯åŠ¨...
[INFO] ä»¿çœŸç»ˆç«¯æ¨¡å¼å·²ç”Ÿæ•ˆï¼Œæ‚¨å¯ä»¥ç›´æ¥åœ¨ç»ˆç«¯å†…ç›´æ¥è¾“å…¥å†…å®¹å¹¶ä½¿ç”¨ Ctrlï¼ŒTab ç­‰åŠŸèƒ½é”®
[INFO] å®ä¾‹å·²å¯åŠ¨...
[0;32mä¸»æœºå¯†é’¥æ·»åŠ æˆåŠŸ[0m
[H[2J[3J[0;32m=== Minecraftä¸–ç•Œæ–‡ä»¶ä¼ è¾“å·¥å…· ===[0m
[0;34mæœ¬åœ°ç›®å½•: /workspace/AppData/MinecraftServer[0m
[0;34mSFTPæœåŠ¡å™¨: 21369@156.246.90.110:11520[0m

[1;33mè¯·é€‰æ‹©æ“ä½œ:[0m
  [0;32m[D][0mownload - ä»æœåŠ¡å™¨ä¸‹è½½ä¸–ç•Œæ–‡ä»¶
  [0;32m[U][0mpload   - ä¸Šä¼ ä¸–ç•Œæ–‡ä»¶åˆ°æœåŠ¡å™¨
  [0;32m[C][0mancel   - å–æ¶ˆ

è¯·é€‰æ‹© [D/U/C]: U
[0;32mä½ é€‰æ‹©äº†: ä¸Šä¼ ä¸–ç•Œæ–‡ä»¶[0m

[0;32må¼€å§‹ä¸Šä¼ ä¸–ç•Œæ–‡ä»¶...[0m
[1;33mæ­£åœ¨å‹ç¼©ä¸–ç•Œæ–‡ä»¶å¤¹...[0m
[1;33mæ­£åœ¨å‹ç¼©ï¼Œè¯·ç¨å€™...[0m
[0;32må‹ç¼©å®Œæˆ (å¤§å°: 4.0K)[0m
[1;33mè¿æ¥SFTPæœåŠ¡å™¨...[0m
Connected to 156.246.90.110.
sftp> cd /
sftp> lcd "/workspace/AppData/MinecraftServer"
sftp> put "world.zip"
Uploading world.zip to /world.zip
remote open("/world.zip"): Permission denied
sftp> bye
[0;32mä¸–ç•Œæ–‡ä»¶ä¸Šä¼ æˆåŠŸ[0m
[0;32må·²æ¸…ç†ä¸´æ—¶æ–‡ä»¶[0m
[0;32mâœ“ ä¸Šä¼ æ“ä½œå®Œæˆ[0m

æŒ‰ä»»æ„é”®è¿”å›ä¸»èœå•...
[H[2J[3J[0;32m=== Minecraftä¸–ç•Œæ–‡ä»¶ä¼ è¾“å·¥å…· ===[0m
[0;34mæœ¬åœ°ç›®å½•: /workspace/AppData/MinecraftServer[0m
[0;34mSFTPæœåŠ¡å™¨: 21369@156.246.90.110:11520[0m

[1;33mè¯·é€‰æ‹©æ“ä½œ:[0m
  [0;32m[D][0mownload - ä»æœåŠ¡å™¨ä¸‹è½½ä¸–ç•Œæ–‡ä»¶
  [0;32m[U][0mpload   - ä¸Šä¼ ä¸–ç•Œæ–‡ä»¶åˆ°æœåŠ¡å™¨
  [0;32m[C][0mancel   - å–æ¶ˆ

è¯·é€‰æ‹© [D/U/C]: D
[0;32mä½ é€‰æ‹©äº†: ä¸‹è½½ä¸–ç•Œæ–‡ä»¶[0m

[0;32må¼€å§‹ä¸‹è½½ä¸–ç•Œæ–‡ä»¶...[0m
[1;33mè¿æ¥SFTPæœåŠ¡å™¨...[0m
Connected to 156.246.90.110.
sftp> cd /
sftp> lcd "/workspace/AppData/MinecraftServer"
sftp> get "world.zip"
File "/world.zip" not found.
sftp> bye
[0;31mä¸‹è½½å¤±è´¥ï¼è¯·æ£€æŸ¥:[0m
1. SFTPæœåŠ¡å™¨æ˜¯å¦å¯è®¿é—®
2. ç”¨æˆ·åå¯†ç æ˜¯å¦æ­£ç¡®
3. æœåŠ¡å™¨ä¸Šæ˜¯å¦å­˜åœ¨ world.zip æ–‡ä»¶
[0;31mâœ— ä¸‹è½½æ“ä½œå¤±è´¥[0m

æŒ‰ä»»æ„é”®è¿”å›ä¸»èœå•...[INFO] å®ä¾‹å·²åœæ­¢ã€‚
[INFO] æ­£åœ¨å¯åŠ¨...
[INFO] ä»¿çœŸç»ˆç«¯æ¨¡å¼å·²ç”Ÿæ•ˆï¼Œæ‚¨å¯ä»¥ç›´æ¥åœ¨ç»ˆç«¯å†…ç›´æ¥è¾“å…¥å†…å®¹å¹¶ä½¿ç”¨ Ctrlï¼ŒTab ç­‰åŠŸèƒ½é”®
[INFO] å®ä¾‹å·²å¯åŠ¨...
^C
[1;33mç¨‹åºè¢«ç”¨æˆ·ä¸­æ–­[0m
[1;33mæ£€æŸ¥æ‰€éœ€å·¥å…·...[0m
[1;33mæ·»åŠ SFTPä¸»æœºå¯†é’¥...[0m
[0;32mä¸»æœºå¯†é’¥æ·»åŠ æˆåŠŸ[0m
[H[2J[3J[0;32m=== Minecraftä¸–ç•Œæ–‡ä»¶ä¼ è¾“å·¥å…· ===[0m
[0;34mæœ¬åœ°ç›®å½•: /workspace/AppData/MinecraftServer[0m
[0;34mSFTPæœåŠ¡å™¨: 21369@156.246.90.110:11520[0m

[1;33mè¯·é€‰æ‹©æ“ä½œ:[0m
  [0;32m[D][0mownload - ä»æœåŠ¡å™¨ä¸‹è½½ä¸–ç•Œæ–‡ä»¶
  [0;32m[U][0mpload   - ä¸Šä¼ ä¸–ç•Œæ–‡ä»¶åˆ°æœåŠ¡å™¨
  [0;32m[C][0mancel   - å–æ¶ˆ

è¯·é€‰æ‹© [D/U/C]: D
[0;32mä½ é€‰æ‹©äº†: ä¸‹è½½ä¸–ç•Œæ–‡ä»¶[0m

[0;32må¼€å§‹ä¸‹è½½ä¸–ç•Œæ–‡ä»¶...[0m
[1;33mè¿æ¥SFTPæœåŠ¡å™¨...[0m
Connected to 156.246.90.110.
sftp> get "world.zip" "/workspace/AppData/MinecraftServer/world.zip"
Fetching /21369/world.zip to /workspace/AppData/MinecraftServer/world.zip
sftp> bye
[0;32mæ–‡ä»¶ä¸‹è½½æˆåŠŸ (å¤§å°: 159M)[0m
[1;33må¤‡ä»½æ—§çš„ä¸–ç•Œæ–‡ä»¶...[0m
[0;32må·²å¤‡ä»½åˆ°: /workspace/AppData/MinecraftServer_backup_20251221_001853[0m
[1;33mæ­£åœ¨è§£å‹æ–‡ä»¶...[0m
[0;32mä¸–ç•Œæ–‡ä»¶è§£å‹æˆåŠŸ[0m
[0;32må·²åˆ é™¤ä¸´æ—¶æ–‡ä»¶[0m
[1;33mä¸–ç•Œæ–‡ä»¶å¤¹å†…å®¹:[0m
total 108
drwxr-sr-x. 12 root root 16384 Dec 21 00:18 .
drwxr-sr-x. 11 root root 16384 Dec 21 00:18 ..
drwxr-sr-x.  6 root root    59 Dec 21 00:18 DIM-1
drwxr-sr-x.  6 root root    59 Dec 21 00:18 DIM1
[0;32må…± 163 ä¸ªæ–‡ä»¶[0m
[0;32mâœ“ ä¸‹è½½æ“ä½œå®Œæˆ[0m

æŒ‰ä»»æ„é”®è¿”å›ä¸»èœå•...
[H[2J[3J[0;32m=== Minecraftä¸–ç•Œæ–‡ä»¶ä¼ è¾“å·¥å…· ===[0m
[0;34mæœ¬åœ°ç›®å½•: /workspace/AppData/MinecraftServer[0m
[0;34mSFTPæœåŠ¡å™¨: 21369@156.246.90.110:11520[0m

[1;33mè¯·é€‰æ‹©æ“ä½œ:[0m
  [0;32m[D][0mownload - ä»æœåŠ¡å™¨ä¸‹è½½ä¸–ç•Œæ–‡ä»¶
  [0;32m[U][0mpload   - ä¸Šä¼ ä¸–ç•Œæ–‡ä»¶åˆ°æœåŠ¡å™¨
  [0;32m[C][0mancel   - å–æ¶ˆ

è¯·é€‰æ‹© [D/U/C]: D
[0;32mä½ é€‰æ‹©äº†: ä¸‹è½½ä¸–ç•Œæ–‡ä»¶[0m

[0;32må¼€å§‹ä¸‹è½½ä¸–ç•Œæ–‡ä»¶...[0m
[1;33mè¿æ¥SFTPæœåŠ¡å™¨...[0m
Connected to 156.246.90.110.
sftp> get "world.zip" "/workspace/AppData/MinecraftServer/world.zip"
Fetching /21369/world.zip to /workspace/AppData/MinecraftServer/world.zip
sftp> bye
[0;32mæ–‡ä»¶ä¸‹è½½æˆåŠŸ (å¤§å°: 159M)[0m
[1;33mæ­£åœ¨è§£å‹æ–‡ä»¶...[0m
[0;32mä¸–ç•Œæ–‡ä»¶è§£å‹æˆåŠŸ[0m
[0;32må·²åˆ é™¤ä¸´æ—¶æ–‡ä»¶[0m
[1;33mä¸–ç•Œæ–‡ä»¶å¤¹å†…å®¹:[0m
total 108
drwxr-sr-x. 12 root root 16384 Dec 21 00:24 .
drwxr-sr-x. 11 root root 16384 Dec 21 00:24 ..
drwxr-sr-x.  6 root root    59 Dec 21 00:24 DIM-1
drwxr-sr-x.  6 root root    59 Dec 21 00:24 DIM1
[0;32må…± 163 ä¸ªæ–‡ä»¶[0m
[0;32mâœ“ ä¸‹è½½æ“ä½œå®Œæˆ[0m

æŒ‰ä»»æ„é”®è¿”å›ä¸»èœå•...
[H[2J[3J[0;32m=== Minecraftä¸–ç•Œæ–‡ä»¶ä¼ è¾“å·¥å…· ===[0m
[0;34mæœ¬åœ°ç›®å½•: /workspace/AppData/MinecraftServer[0m
[0;34mSFTPæœåŠ¡å™¨: 21369@156.246.90.110:11520[0m

[1;33mè¯·é€‰æ‹©æ“ä½œ:[0m
  [0;32m[D][0mownload - ä»æœåŠ¡å™¨ä¸‹è½½ä¸–ç•Œæ–‡ä»¶
  [0;32m[U][0mpload   - ä¸Šä¼ ä¸–ç•Œæ–‡ä»¶åˆ°æœåŠ¡å™¨
  [0;32m[C][0mancel   - å–æ¶ˆ

è¯·é€‰æ‹© [D/U/C]: U
[0;32mä½ é€‰æ‹©äº†: ä¸Šä¼ ä¸–ç•Œæ–‡ä»¶[0m

[0;32må¼€å§‹ä¸Šä¼ ä¸–ç•Œæ–‡ä»¶...[0m
[1;33mæœ¬åœ°æœªæ‰¾åˆ° world.zipï¼Œæ­£åœ¨æ£€æŸ¥ä¸–ç•Œæ–‡ä»¶å¤¹...[0m
[1;33mæ­£åœ¨å‹ç¼©ä¸–ç•Œæ–‡ä»¶å¤¹...[0m
[1;33mæ­£åœ¨å‹ç¼©ï¼Œè¯·ç¨å€™...[0m
[0;32må‹ç¼©å®Œæˆ (å¤§å°: 88M)[0m
[1;33mè¿æ¥SFTPæœåŠ¡å™¨...[0m
Connected to 156.246.90.110.
sftp> put "/workspace/AppData/MinecraftServer/world.zip" "world.zip"
Uploading /workspace/AppData/MinecraftServer/world.zip to /21369/world.zip
remote open("/21369/world.zip"): Permission denied
sftp> bye
[0;32mä¸–ç•Œæ–‡ä»¶ä¸Šä¼ æˆåŠŸ[0m
[1;33mæ˜¯å¦åˆ é™¤æœ¬åœ°ä¸´æ—¶æ–‡ä»¶ world.zipï¼Ÿ[y/N]: [0my
[0;32må·²åˆ é™¤æœ¬åœ°ä¸´æ—¶æ–‡ä»¶[0m
[0;32mâœ“ ä¸Šä¼ æ“ä½œå®Œæˆ[0m

æŒ‰ä»»æ„é”®è¿”å›ä¸»èœå•...
[H[2J[3J[0;32m=== Minecraftä¸–ç•Œæ–‡ä»¶ä¼ è¾“å·¥å…· ===[0m
[0;34mæœ¬åœ°ç›®å½•: /workspace/AppData/MinecraftServer[0m
[0;34mSFTPæœåŠ¡å™¨: 21369@156.246.90.110:11520[0m

[1;33mè¯·é€‰æ‹©æ“ä½œ:[0m
  [0;32m[D][0mownload - ä»æœåŠ¡å™¨ä¸‹è½½ä¸–ç•Œæ–‡ä»¶
  [0;32m[U][0mpload   - ä¸Šä¼ ä¸–ç•Œæ–‡ä»¶åˆ°æœåŠ¡å™¨
  [0;32m[C][0mancel   - å–æ¶ˆ

è¯·é€‰æ‹© [D/U/C]: U
[0;32mä½ é€‰æ‹©äº†: ä¸Šä¼ ä¸–ç•Œæ–‡ä»¶[0m

[0;32må¼€å§‹ä¸Šä¼ ä¸–ç•Œæ–‡ä»¶...[0m
[1;33mæœ¬åœ°æœªæ‰¾åˆ° world.zipï¼Œæ­£åœ¨æ£€æŸ¥ä¸–ç•Œæ–‡ä»¶å¤¹...[0m
[1;33mæ­£åœ¨å‹ç¼©ä¸–ç•Œæ–‡ä»¶å¤¹...[0m
[1;33mæ­£åœ¨å‹ç¼©ï¼Œè¯·ç¨å€™...[0m
[0;32må‹ç¼©å®Œæˆ (å¤§å°: 88M)[0m
[1;33mè¿æ¥SFTPæœåŠ¡å™¨...[0m
Connected to 156.246.90.110.
sftp> put "/workspace/AppData/MinecraftServer/world.zip" "world.zip"
Uploading /workspace/AppData/MinecraftServer/world.zip to /21369/world.zip
sftp> bye
[0;32mä¸–ç•Œæ–‡ä»¶ä¸Šä¼ æˆåŠŸ[0m
[1;33mæ˜¯å¦åˆ é™¤æœ¬åœ°ä¸´æ—¶æ–‡ä»¶ world.zipï¼Ÿ[y/N]: [0my
[0;32må·²åˆ é™¤æœ¬åœ°ä¸´æ—¶æ–‡ä»¶[0m
[0;32mâœ“ ä¸Šä¼ æ“ä½œå®Œæˆ[0m

æŒ‰ä»»æ„é”®è¿”å›ä¸»èœå•...
[H[2J[3J[0;32m=== Minecraftä¸–ç•Œæ–‡ä»¶ä¼ è¾“å·¥å…· ===[0m
[0;34mæœ¬åœ°ç›®å½•: /workspace/AppData/MinecraftServer[0m
[0;34mSFTPæœåŠ¡å™¨: 21369@156.246.90.110:11520[0m

[1;33mè¯·é€‰æ‹©æ“ä½œ:[0m
  [0;32m[D][0mownload - ä»æœåŠ¡å™¨ä¸‹è½½ä¸–ç•Œæ–‡ä»¶
  [0;32m[U][0mpload   - ä¸Šä¼ ä¸–ç•Œæ–‡ä»¶åˆ°æœåŠ¡å™¨
  [0;32m[C][0mancel   - å–æ¶ˆ

è¯·é€‰æ‹© [D/U/C]: [INFO] å®ä¾‹å·²åœæ­¢ã€‚
[INFO] æ­£åœ¨å¯åŠ¨...
[INFO] ä»¿çœŸç»ˆç«¯æ¨¡å¼å·²ç”Ÿæ•ˆï¼Œæ‚¨å¯ä»¥ç›´æ¥åœ¨ç»ˆç«¯å†…ç›´æ¥è¾“å…¥å†…å®¹å¹¶ä½¿ç”¨ Ctrlï¼ŒTab ç­‰åŠŸèƒ½é”®
[INFO] å®ä¾‹å·²å¯åŠ¨...
c
[1;33må–æ¶ˆæ“ä½œï¼Œé€€å‡ºç¨‹åº[0m
[1;33mæ£€æŸ¥æ‰€éœ€å·¥å…·...[0m
[1;33mæ·»åŠ SFTPä¸»æœºå¯†é’¥...[0m
[0;32mä¸»æœºå¯†é’¥æ·»åŠ æˆåŠŸ[0m
[H[2J[3J[0;32m=== Minecraftä¸–ç•Œæ–‡ä»¶ä¼ è¾“å·¥å…· ===[0m
[0;34mæœ¬åœ°ç›®å½•: /workspace/AppData/MinecraftServer[0m
[0;34mSFTPæœåŠ¡å™¨: 21369@156.246.90.110:11520[0m

[1;33mè¯·é€‰æ‹©æ“ä½œ:[0m
  [0;32m[D][0mownload - ä»æœåŠ¡å™¨ä¸‹è½½ä¸–ç•Œæ–‡ä»¶
  [0;32m[U][0mpload   - ä¸Šä¼ ä¸–ç•Œæ–‡ä»¶åˆ°æœåŠ¡å™¨
  [0;32m[C][0mancel   - å–æ¶ˆ

è¯·é€‰æ‹© [D/U/C]: D
[0;32mä½ é€‰æ‹©äº†: ä¸‹è½½ä¸–ç•Œæ–‡ä»¶[0m

[0;32må¼€å§‹ä¸‹è½½ä¸–ç•Œæ–‡ä»¶...[0m
[1;33mè¿æ¥SFTPæœåŠ¡å™¨...[0m
Connected to 156.246.90.110.
sftp> get "world.zip" "/workspace/AppData/MinecraftServer/world.zip"
Fetching /21369/world.zip to /workspace/AppData/MinecraftServer/world.zip
sftp> bye
[0;32mæ–‡ä»¶ä¸‹è½½æˆåŠŸ (å¤§å°: 88M)[0m
[1;33må¤‡ä»½æ—§çš„ä¸–ç•Œæ–‡ä»¶...[0m
[0;32må·²å¤‡ä»½åˆ°: /workspace/AppData/MinecraftServer_backup_20251221_004256[0m
[1;33mæ­£åœ¨è§£å‹æ–‡ä»¶...[0m
[0;32mä¸–ç•Œæ–‡ä»¶è§£å‹æˆåŠŸ[0m
[0;32må·²åˆ é™¤ä¸´æ—¶æ–‡ä»¶[0m
[1;33mä¸–ç•Œæ–‡ä»¶å¤¹å†…å®¹:[0m
total 108
drwxr-sr-x. 12 root root 16384 Dec 21 00:24 .
drwxr-sr-x. 11 root root 16384 Dec 21 00:42 ..
drwxr-sr-x.  6 root root    59 Dec 21 00:24 DIM-1
drwxr-sr-x.  6 root root    59 Dec 21 00:24 DIM1
[0;32må…± 163 ä¸ªæ–‡ä»¶[0m
[0;32mâœ“ ä¸‹è½½æ“ä½œå®Œæˆ[0m

[1;33m2ç§’åè¿”å›ä¸»èœå•...[0m
[H[2J[3J[0;32m=== Minecraftä¸–ç•Œæ–‡ä»¶ä¼ è¾“å·¥å…· ===[0m
[0;34mæœ¬åœ°ç›®å½•: /workspace/AppData/MinecraftServer[0m
[0;34mSFTPæœåŠ¡å™¨: 21369@156.246.90.110:11520[0m

[1;33mè¯·é€‰æ‹©æ“ä½œ:[0m
  [0;32m[D][0mownload - ä»æœåŠ¡å™¨ä¸‹è½½ä¸–ç•Œæ–‡ä»¶
  [0;32m[U][0mpload   - ä¸Šä¼ ä¸–ç•Œæ–‡ä»¶åˆ°æœåŠ¡å™¨
  [0;32m[C][0mancel   - å–æ¶ˆ

è¯·é€‰æ‹© [D/U/C]: D
[0;32mä½ é€‰æ‹©äº†: ä¸‹è½½ä¸–ç•Œæ–‡ä»¶[0m

[0;32må¼€å§‹ä¸‹è½½ä¸–ç•Œæ–‡ä»¶...[0m
[1;33mè¿æ¥SFTPæœåŠ¡å™¨...[0m
Connected to 156.246.90.110.
sftp> get "world.zip" "/workspace/AppData/MinecraftServer/world.zip"
Fetching /21369/world.zip to /workspace/AppData/MinecraftServer/world.zip
sftp> bye
[0;32mæ–‡ä»¶ä¸‹è½½æˆåŠŸ (å¤§å°: 88M)[0m
[1;33mæ­£åœ¨è§£å‹æ–‡ä»¶...[0m
[0;32mä¸–ç•Œæ–‡ä»¶è§£å‹æˆåŠŸ[0m
[0;32må·²åˆ é™¤ä¸´æ—¶æ–‡ä»¶[0m
[1;33mä¸–ç•Œæ–‡ä»¶å¤¹å†…å®¹:[0m
total 108
drwxr-sr-x. 12 root root 16384 Dec 21 00:24 .
drwxr-sr-x. 11 root root 16384 Dec 21 00:44 ..
drwxr-sr-x.  6 root root    59 Dec 21 00:24 DIM-1
drwxr-sr-x.  6 root root    59 Dec 21 00:24 DIM1
[0;32må…± 163 ä¸ªæ–‡ä»¶[0m
[0;32mâœ“ ä¸‹è½½æ“ä½œå®Œæˆ[0m

[1;33m2ç§’åè¿”å›ä¸»èœå•...[0m
[H[2J[3J[0;32m=== Minecraftä¸–ç•Œæ–‡ä»¶ä¼ è¾“å·¥å…· ===[0m
[0;34mæœ¬åœ°ç›®å½•: /workspace/AppData/MinecraftServer[0m
[0;34mSFTPæœåŠ¡å™¨: 21369@156.246.90.110:11520[0m

[1;33mè¯·é€‰æ‹©æ“ä½œ:[0m
  [0;32m[D][0mownload - ä»æœåŠ¡å™¨ä¸‹è½½ä¸–ç•Œæ–‡ä»¶
  [0;32m[U][0mpload   - ä¸Šä¼ ä¸–ç•Œæ–‡ä»¶åˆ°æœåŠ¡å™¨
  [0;32m[C][0mancel   - å–æ¶ˆ

è¯·é€‰æ‹© [D/U/C]: U
[0;32mä½ é€‰æ‹©äº†: ä¸Šä¼ ä¸–ç•Œæ–‡ä»¶[0m

[0;32må¼€å§‹ä¸Šä¼ ä¸–ç•Œæ–‡ä»¶...[0m
[1;33mæœ¬åœ°æœªæ‰¾åˆ° world.zipï¼Œæ­£åœ¨æ£€æŸ¥ä¸–ç•Œæ–‡ä»¶å¤¹...[0m
[1;33mæ­£åœ¨å‹ç¼©ä¸–ç•Œæ–‡ä»¶å¤¹...[0m
[1;33mæ­£åœ¨å‹ç¼©ï¼Œè¯·ç¨å€™...[0m
[0;32må‹ç¼©å®Œæˆ (å¤§å°: 88M)[0m
[1;33mè¿æ¥SFTPæœåŠ¡å™¨...[0m
Connected to 156.246.90.110.
sftp> rm world.zip
Removing /21369/world.zip
sftp> put "/workspace/AppData/MinecraftServer/world.zip" "world.zip"
Uploading /workspace/AppData/MinecraftServer/world.zip to /21369/world.zip
Connection to 156.246.90.110 closed by remote host.
Connection closed
[0;31mä¸Šä¼ å¤±è´¥ (é”™è¯¯ç : 255)[0m
[1;33må·²æ¸…ç†æœ¬åœ°ä¸´æ—¶å‹ç¼©æ–‡ä»¶[0m
[0;31mâœ— ä¸Šä¼ æ“ä½œå¤±è´¥[0m

[1;33m2ç§’åè¿”å›ä¸»èœå•...[0m
[H[2J[3J[0;32m=== Minecraftä¸–ç•Œæ–‡ä»¶ä¼ è¾“å·¥å…· ===[0m
[0;34mæœ¬åœ°ç›®å½•: /workspace/AppData/MinecraftServer[0m
[0;34mSFTPæœåŠ¡å™¨: 21369@156.246.90.110:11520[0m

[1;33mè¯·é€‰æ‹©æ“ä½œ:[0m
  [0;32m[D][0mownload - ä»æœåŠ¡å™¨ä¸‹è½½ä¸–ç•Œæ–‡ä»¶
  [0;32m[U][0mpload   - ä¸Šä¼ ä¸–ç•Œæ–‡ä»¶åˆ°æœåŠ¡å™¨
  [0;32m[C][0mancel   - å–æ¶ˆ

è¯·é€‰æ‹© [D/U/C]: [INFO] æ­£åœ¨å¯åŠ¨...
[INFO] ä»¿çœŸç»ˆç«¯æ¨¡å¼å·²ç”Ÿæ•ˆï¼Œæ‚¨å¯ä»¥ç›´æ¥åœ¨ç»ˆç«¯å†…ç›´æ¥è¾“å…¥å†…å®¹å¹¶ä½¿ç”¨ Ctrlï¼ŒTab ç­‰åŠŸèƒ½é”®
[INFO] å®ä¾‹å·²å¯åŠ¨...
[1;33mæ£€æŸ¥æ‰€éœ€å·¥å…·...[0m
[1;33må®‰è£…sshpass...[0m
[0;32msshpasså®‰è£…å®Œæˆ[0m
[1;33må®‰è£…zip/unzip...[0m
[0;32mzip/unzipå®‰è£…å®Œæˆ[0m
[1;33mæ·»åŠ SFTPä¸»æœºå¯†é’¥...[0m
[0;32mä¸»æœºå¯†é’¥æ·»åŠ æˆåŠŸ[0m
[H[2J[3J[0;32m=== Minecraftä¸–ç•Œæ–‡ä»¶ä¼ è¾“å·¥å…· ===[0m
[0;34mæœ¬åœ°ç›®å½•: /workspace/AppData/MinecraftServer[0m
[0;34mSFTPæœåŠ¡å™¨: 21369@156.246.90.110:11520[0m

[1;33mè¯·é€‰æ‹©æ“ä½œ:[0m
  [0;32m[D][0mownload - ä»æœåŠ¡å™¨ä¸‹è½½ä¸–ç•Œæ–‡ä»¶
  [0;32m[U][0mpload   - ä¸Šä¼ ä¸–ç•Œæ–‡ä»¶åˆ°æœåŠ¡å™¨
  [0;32m[C][0mancel   - å–æ¶ˆ

è¯·é€‰æ‹© [D/U/C]: 